stack-underflow-backend/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "[FILTERED]"], ["id", 1], ["LIMIT", 1]]
---
  def generate_unique_session_token
    while true
      session_token = SecureRandom.urlsafe_base64
      return session_token if !User.exists?(session_token)