stack-underflow-backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token])# user whose `session_token` == token in `session` cookie

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def test
    if params.has_key?(:login)
      login!(User.first)